================================================================================
/an/expression
(: <- followed by a comment :)
================================================================================
/an/expression
(: <- followed by a comment :)
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier))))
  (comment
    (comment_content)))

================================================================================
/xpath/expression
================================================================================
/xpath/expression
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))))

================================================================================
concat("Evaluates to: ", /xpath/expression)
================================================================================
concat("Evaluates to: ", /xpath/expression)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (string_literal)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
./author
================================================================================
./author
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (context_item_expr))
    (step_expr
      (name_test
        (identifier)))))

================================================================================
first.name
================================================================================
first.name
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))))

================================================================================
/bookstore
================================================================================
/bookstore
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))))

================================================================================
//author
================================================================================
//author
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))))

================================================================================
author/first-name
================================================================================
author/first-name
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))))

================================================================================
bookstore//title
================================================================================
bookstore//title
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))))

================================================================================
bookstore/*/title
================================================================================
bookstore/*/title
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test))
    (step_expr
      (name_test
        (identifier)))))

================================================================================
bookstore//book/excerpt//emph
================================================================================
bookstore//book/excerpt//emph
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))))

================================================================================
.//title
================================================================================
.//title
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (context_item_expr))
    (step_expr
      (name_test
        (identifier)))))

================================================================================
book/*/last-name
================================================================================
book/*/last-name
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test))
    (step_expr
      (name_test
        (identifier)))))

================================================================================
@style
================================================================================
@style
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (abbrev_foward)
      (name_test
        (identifier)))))

================================================================================
price/@exchange
================================================================================
price/@exchange
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (abbrev_foward)
      (name_test
        (identifier)))))

================================================================================
price/@exchange/total
================================================================================
price/@exchange/total
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (abbrev_foward)
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))))

================================================================================
book/@style
================================================================================
book/@style
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (abbrev_foward)
      (name_test
        (identifier)))))

================================================================================
./first-name
================================================================================
./first-name
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (context_item_expr))
    (step_expr
      (name_test
        (identifier)))))

================================================================================
first-name
================================================================================
first-name
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))))

================================================================================
my:book
================================================================================
my:book
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)
        (identifier)))))

================================================================================
../../some-path
================================================================================
../../some-path
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (abbrev_reverse))
    (step_expr
      (abbrev_reverse))
    (step_expr
      (name_test
        (identifier)))))

================================================================================
*/*
================================================================================
*/*
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test))
    (step_expr
      (name_test))))

================================================================================
@*
================================================================================
@*
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (abbrev_foward)
      (name_test))))

================================================================================
@my:*
================================================================================
@my:*
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (abbrev_foward)
      (name_test
        (NCName
          (identifier))))))

================================================================================
my:*
================================================================================
my:*
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (NCName
          (identifier))))))

================================================================================
/simple/xpath/to/node = 1
================================================================================
/simple/xpath/to/node = 1
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier))))
  (integer_literal))

================================================================================
/simple/xpath/to/node != 1
================================================================================
/simple/xpath/to/node != 1
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier))))
  (integer_literal))

================================================================================
/simple/xpath/to/node < 1
================================================================================
/simple/xpath/to/node < 1
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier))))
  (integer_literal))

================================================================================
/simple/xpath/to/node > 1
================================================================================
/simple/xpath/to/node > 1
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier))))
  (integer_literal))

================================================================================
/simple/xpath/to/node <= 1
================================================================================
/simple/xpath/to/node <= 1
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier))))
  (integer_literal))

================================================================================
/simple/xpath/to/node >= 1
================================================================================
/simple/xpath/to/node >= 1
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier))))
  (integer_literal))

================================================================================
/simple/xpath/to/node = "1"
================================================================================
/simple/xpath/to/node = "1"
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier))))
  (string_literal))

================================================================================
/simple/xpath/to/node != "1"
================================================================================
/simple/xpath/to/node != "1"
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier))))
  (string_literal))

================================================================================
if(selected(/model/instance[1]/pregnancy/group_lmp/lmp_method, 'date'), /model/instance[1]/pregnancy/group_lmp/lmp_date, 'testing')
================================================================================
if(selected(/model/instance[1]/pregnancy/group_lmp/lmp_method, 'date'), /model/instance[1]/pregnancy/group_lmp/lmp_date, 'testing')
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (function_call
      (identifier)
      (path_expr
        (step_expr
          (name_test
            (identifier)))
        (step_expr
          (name_test
            (identifier))
          (predicate
            (integer_literal)))
        (step_expr
          (name_test
            (identifier)))
        (step_expr
          (name_test
            (identifier)))
        (step_expr
          (name_test
            (identifier))))
      (string_literal))
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))
        (predicate
          (integer_literal)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))
    (string_literal)))

================================================================================
if(selected(/model/instance[1]/pregnancy/group_lmp/lmp_method, 'date'), /model/instance[1]/pregnancy/group_lmp/lmp_date, concat('testing', '1', '2', '3', '...'))
================================================================================
if(selected(/model/instance[1]/pregnancy/group_lmp/lmp_method, 'date'), /model/instance[1]/pregnancy/group_lmp/lmp_date, concat('testing', '1', '2', '3', '...'))
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (function_call
      (identifier)
      (path_expr
        (step_expr
          (name_test
            (identifier)))
        (step_expr
          (name_test
            (identifier))
          (predicate
            (integer_literal)))
        (step_expr
          (name_test
            (identifier)))
        (step_expr
          (name_test
            (identifier)))
        (step_expr
          (name_test
            (identifier))))
      (string_literal))
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))
        (predicate
          (integer_literal)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))
    (function_call
      (identifier)
      (string_literal)
      (string_literal)
      (string_literal)
      (string_literal)
      (string_literal))))

================================================================================
if(selected(/model/instance[1]/pregnancy/group_lmp/lmp_method, 'date'), /model/instance[1]/pregnancy/group_lmp/lmp_date, date-time(0))
================================================================================
if(selected(/model/instance[1]/pregnancy/group_lmp/lmp_method, 'date'), /model/instance[1]/pregnancy/group_lmp/lmp_date, date-time(0))
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (function_call
      (identifier)
      (path_expr
        (step_expr
          (name_test
            (identifier)))
        (step_expr
          (name_test
            (identifier))
          (predicate
            (integer_literal)))
        (step_expr
          (name_test
            (identifier)))
        (step_expr
          (name_test
            (identifier)))
        (step_expr
          (name_test
            (identifier))))
      (string_literal))
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))
        (predicate
          (integer_literal)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))
    (function_call
      (identifier)
      (integer_literal))))

================================================================================
if(selected(/model/instance[1]/pregnancy/group_lmp/lmp_method, 'date'), /model/instance[1]/pregnancy/group_lmp/lmp_date, date-time(decimal-date-time(today() - 60)))
================================================================================
if(selected(/model/instance[1]/pregnancy/group_lmp/lmp_method, 'date'), /model/instance[1]/pregnancy/group_lmp/lmp_date, date-time(decimal-date-time(today() - 60)))
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (function_call
      (identifier)
      (path_expr
        (step_expr
          (name_test
            (identifier)))
        (step_expr
          (name_test
            (identifier))
          (predicate
            (integer_literal)))
        (step_expr
          (name_test
            (identifier)))
        (step_expr
          (name_test
            (identifier)))
        (step_expr
          (name_test
            (identifier))))
      (string_literal))
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))
        (predicate
          (integer_literal)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))
    (function_call
      (identifier)
      (function_call
        (identifier)
        (function_call
          (identifier))
        (integer_literal)))))

================================================================================
if(selected(/model/instance[1]/pregnancy/group_lmp/lmp_method ,'date'), /model/instance[1]/pregnancy/group_lmp/lmp_date ,date-time(decimal-date-time(today()- 60 )))
================================================================================
if(selected(/model/instance[1]/pregnancy/group_lmp/lmp_method ,'date'), /model/instance[1]/pregnancy/group_lmp/lmp_date ,date-time(decimal-date-time(today()- 60 )))
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (function_call
      (identifier)
      (path_expr
        (step_expr
          (name_test
            (identifier)))
        (step_expr
          (name_test
            (identifier))
          (predicate
            (integer_literal)))
        (step_expr
          (name_test
            (identifier)))
        (step_expr
          (name_test
            (identifier)))
        (step_expr
          (name_test
            (identifier))))
      (string_literal))
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))
        (predicate
          (integer_literal)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))
    (function_call
      (identifier)
      (function_call
        (identifier)
        (function_call
          (identifier))
        (integer_literal)))))

================================================================================
if(/something, 'A', 'B' )
================================================================================
if(/something, 'A', 'B' )
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier))))
    (string_literal)
    (string_literal)))

================================================================================
if(/something  != '', 'A', 'B' )
================================================================================
if(/something  != '', 'A', 'B' )
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier))))
    (string_literal)
    (string_literal)
    (string_literal)))

================================================================================
if (/something, 'A', 'B' )
================================================================================
if (/something, 'A', 'B' )
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier))))
    (string_literal)
    (string_literal)))

================================================================================
if (/something  != '', 'A', 'B' )
================================================================================
if (/something  != '', 'A', 'B' )
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier))))
    (string_literal)
    (string_literal)
    (string_literal)))

================================================================================
not(selected(../dob_method,'approx'))
================================================================================
not(selected(../dob_method,'approx'))
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (function_call
      (identifier)
      (path_expr
        (step_expr
          (abbrev_reverse))
        (step_expr
          (name_test
            (identifier))))
      (string_literal))))

================================================================================
not(not(selected(../dob_method,'approx')))
================================================================================
not(not(selected(../dob_method,'approx')))
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (function_call
      (identifier)
      (function_call
        (identifier)
        (path_expr
          (step_expr
            (abbrev_reverse))
          (step_expr
            (name_test
              (identifier))))
        (string_literal)))))

================================================================================
selected(../dob_method,'approx')
================================================================================
selected(../dob_method,'approx')
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (abbrev_reverse))
      (step_expr
        (name_test
          (identifier))))
    (string_literal)))

================================================================================
.
================================================================================
.
--------------------------------------------------------------------------------

(query
  (context_item_expr))

================================================================================
.>1
================================================================================
.>1
--------------------------------------------------------------------------------

(query
  (context_item_expr)
  (integer_literal))

================================================================================
.> 1
================================================================================
.> 1
--------------------------------------------------------------------------------

(query
  (context_item_expr)
  (integer_literal))

================================================================================
. >1
================================================================================
. >1
--------------------------------------------------------------------------------

(query
  (context_item_expr)
  (integer_literal))

================================================================================
. > 1
================================================================================
. > 1
--------------------------------------------------------------------------------

(query
  (context_item_expr)
  (integer_literal))

================================================================================
.>=1
================================================================================
.>=1
--------------------------------------------------------------------------------

(query
  (context_item_expr)
  (integer_literal))

================================================================================
.>= 1
================================================================================
.>= 1
--------------------------------------------------------------------------------

(query
  (context_item_expr)
  (integer_literal))

================================================================================
. >=1
================================================================================
. >=1
--------------------------------------------------------------------------------

(query
  (context_item_expr)
  (integer_literal))

================================================================================
. >= 1
================================================================================
. >= 1
--------------------------------------------------------------------------------

(query
  (context_item_expr)
  (integer_literal))

================================================================================
.<1
================================================================================
.<1
--------------------------------------------------------------------------------

(query
  (context_item_expr)
  (integer_literal))

================================================================================
.< 1
================================================================================
.< 1
--------------------------------------------------------------------------------

(query
  (context_item_expr)
  (integer_literal))

================================================================================
. <1
================================================================================
. <1
--------------------------------------------------------------------------------

(query
  (context_item_expr)
  (integer_literal))

================================================================================
. < 1
================================================================================
. < 1
--------------------------------------------------------------------------------

(query
  (context_item_expr)
  (integer_literal))

================================================================================
.<=1
================================================================================
.<=1
--------------------------------------------------------------------------------

(query
  (context_item_expr)
  (integer_literal))

================================================================================
.<= 1
================================================================================
.<= 1
--------------------------------------------------------------------------------

(query
  (context_item_expr)
  (integer_literal))

================================================================================
. <=1
================================================================================
. <=1
--------------------------------------------------------------------------------

(query
  (context_item_expr)
  (integer_literal))

================================================================================
. <= 1
================================================================================
. <= 1
--------------------------------------------------------------------------------

(query
  (context_item_expr)
  (integer_literal))

================================================================================
../some-path='some-value'
================================================================================
../some-path='some-value'
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (abbrev_reverse))
    (step_expr
      (name_test
        (identifier))))
  (string_literal))

================================================================================
../some-path="some-value"
================================================================================
../some-path="some-value"
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (abbrev_reverse))
    (step_expr
      (name_test
        (identifier))))
  (string_literal))

================================================================================
../some-path= 'some-value'
================================================================================
../some-path= 'some-value'
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (abbrev_reverse))
    (step_expr
      (name_test
        (identifier))))
  (string_literal))

================================================================================
../some-path ='some-value'
================================================================================
../some-path ='some-value'
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (abbrev_reverse))
    (step_expr
      (name_test
        (identifier))))
  (string_literal))

================================================================================
../some-path = 'some-value'
================================================================================
../some-path = 'some-value'
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (abbrev_reverse))
    (step_expr
      (name_test
        (identifier))))
  (string_literal))

================================================================================
'some-value'=../some-path
================================================================================
'some-value'=../some-path
--------------------------------------------------------------------------------

(query
  (string_literal)
  (path_expr
    (step_expr
      (abbrev_reverse))
    (step_expr
      (name_test
        (identifier)))))

================================================================================
"some-value"=../some-path
================================================================================
"some-value"=../some-path
--------------------------------------------------------------------------------

(query
  (string_literal)
  (path_expr
    (step_expr
      (abbrev_reverse))
    (step_expr
      (name_test
        (identifier)))))

================================================================================
'some-value'= ../some-path
================================================================================
'some-value'= ../some-path
--------------------------------------------------------------------------------

(query
  (string_literal)
  (path_expr
    (step_expr
      (abbrev_reverse))
    (step_expr
      (name_test
        (identifier)))))

================================================================================
'some-value' =../some-path
================================================================================
'some-value' =../some-path
--------------------------------------------------------------------------------

(query
  (string_literal)
  (path_expr
    (step_expr
      (abbrev_reverse))
    (step_expr
      (name_test
        (identifier)))))

================================================================================
'some-value' = ../some-path
================================================================================
'some-value' = ../some-path
--------------------------------------------------------------------------------

(query
  (string_literal)
  (path_expr
    (step_expr
      (abbrev_reverse))
    (step_expr
      (name_test
        (identifier)))))

================================================================================
/simple/xpath/to/node < today() + 1
================================================================================
/simple/xpath/to/node < today() + 1
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier))))
  (function_call
    (identifier))
  (integer_literal))

================================================================================
/simple/xpath/to/node > today() + 1
================================================================================
/simple/xpath/to/node > today() + 1
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier))))
  (function_call
    (identifier))
  (integer_literal))

================================================================================
/simple/xpath/to/node > today() - 1
================================================================================
/simple/xpath/to/node > today() - 1
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier))))
  (function_call
    (identifier))
  (integer_literal))

================================================================================
/simple/xpath/to/node < today() - 1
================================================================================
/simple/xpath/to/node < today() - 1
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier))))
  (function_call
    (identifier))
  (integer_literal))

================================================================================
/simple/xpath/to/node < (today() + 1)
================================================================================
/simple/xpath/to/node < (today() + 1)
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier))))
  (parenthesized_expr
    (function_call
      (identifier))
    (integer_literal)))

================================================================================
/simple/xpath/to/node > (today() + 1)
================================================================================
/simple/xpath/to/node > (today() + 1)
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier))))
  (parenthesized_expr
    (function_call
      (identifier))
    (integer_literal)))

================================================================================
/simple/xpath/to/node > (today() - 1)
================================================================================
/simple/xpath/to/node > (today() - 1)
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier))))
  (parenthesized_expr
    (function_call
      (identifier))
    (integer_literal)))

================================================================================
/simple/xpath/to/node < (today() - 1)
================================================================================
/simple/xpath/to/node < (today() - 1)
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier))))
  (parenthesized_expr
    (function_call
      (identifier))
    (integer_literal)))

================================================================================
/data/a!= /data/b
================================================================================
/data/a!= /data/b
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier))))
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))))

================================================================================
/data/a!=/data/b
================================================================================
/data/a!=/data/b
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier))))
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))))

================================================================================
/data/a!= "1"
================================================================================
/data/a!= "1"
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier))))
  (string_literal))

================================================================================
/data/a!="1"
================================================================================
/data/a!="1"
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier))))
  (string_literal))

================================================================================
"1" != /data/a
================================================================================
"1" != /data/a
--------------------------------------------------------------------------------

(query
  (string_literal)
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))))

================================================================================
"1"!= /data/a
================================================================================
"1"!= /data/a
--------------------------------------------------------------------------------

(query
  (string_literal)
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))))

================================================================================
"1"!=/data/a
================================================================================
"1"!=/data/a
--------------------------------------------------------------------------------

(query
  (string_literal)
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))))

================================================================================
/data/a<= /data/b
================================================================================
/data/a<= /data/b
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier))))
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))))

================================================================================
/data/a<=/data/b
================================================================================
/data/a<=/data/b
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier))))
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))))

================================================================================
/data/a<= "1"
================================================================================
/data/a<= "1"
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier))))
  (string_literal))

================================================================================
/data/a<="1"
================================================================================
/data/a<="1"
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier))))
  (string_literal))

================================================================================
"1" <= /data/a
================================================================================
"1" <= /data/a
--------------------------------------------------------------------------------

(query
  (string_literal)
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))))

================================================================================
"1"<= /data/a
================================================================================
"1"<= /data/a
--------------------------------------------------------------------------------

(query
  (string_literal)
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))))

================================================================================
"1"<=/data/a
================================================================================
"1"<=/data/a
--------------------------------------------------------------------------------

(query
  (string_literal)
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))))

================================================================================
/data/a>= /data/b
================================================================================
/data/a>= /data/b
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier))))
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))))

================================================================================
/data/a>=/data/b
================================================================================
/data/a>=/data/b
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier))))
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))))

================================================================================
/data/a>= "1"
================================================================================
/data/a>= "1"
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier))))
  (string_literal))

================================================================================
/data/a>="1"
================================================================================
/data/a>="1"
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier))))
  (string_literal))

================================================================================
"1" >= /data/a
================================================================================
"1" >= /data/a
--------------------------------------------------------------------------------

(query
  (string_literal)
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))))

================================================================================
"1">= /data/a
================================================================================
"1">= /data/a
--------------------------------------------------------------------------------

(query
  (string_literal)
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))))

================================================================================
"1">=/data/a
================================================================================
"1">=/data/a
--------------------------------------------------------------------------------

(query
  (string_literal)
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))))

================================================================================
/data/number + 1
================================================================================
/data/number + 1
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier))))
  (integer_literal))

================================================================================
/data/number+1
================================================================================
/data/number+1
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier))))
  (integer_literal))

================================================================================
../number + 1
================================================================================
../number + 1
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (abbrev_reverse))
    (step_expr
      (name_test
        (identifier))))
  (integer_literal))

================================================================================
../number+1
================================================================================
../number+1
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (abbrev_reverse))
    (step_expr
      (name_test
        (identifier))))
  (integer_literal))

================================================================================
boolean(/xhtml:html)
================================================================================
boolean(/xhtml:html)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)
          (identifier))))))

================================================================================
boolean(/asdf)
================================================================================
boolean(/asdf)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier))))))

================================================================================
boolean(//xhtml:article)
================================================================================
boolean(//xhtml:article)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)
          (identifier))))))

================================================================================
-10 = *
================================================================================
-10 = *
--------------------------------------------------------------------------------

(query
  (integer_literal)
  (path_expr
    (step_expr
      (name_test))))

================================================================================
-10 != *
================================================================================
-10 != *
--------------------------------------------------------------------------------

(query
  (integer_literal)
  (path_expr
    (step_expr
      (name_test))))

================================================================================
4 = *
================================================================================
4 = *
--------------------------------------------------------------------------------

(query
  (integer_literal)
  (path_expr
    (step_expr
      (name_test))))

================================================================================
4 != *
================================================================================
4 != *
--------------------------------------------------------------------------------

(query
  (integer_literal)
  (path_expr
    (step_expr
      (name_test))))

================================================================================
4.3 = *
================================================================================
4.3 = *
--------------------------------------------------------------------------------

(query
  (decimal_literal)
  (path_expr
    (step_expr
      (name_test))))

================================================================================
4.3 != *
================================================================================
4.3 != *
--------------------------------------------------------------------------------

(query
  (decimal_literal)
  (path_expr
    (step_expr
      (name_test))))

================================================================================
true() = *
================================================================================
true() = *
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier))
  (path_expr
    (step_expr
      (name_test))))

================================================================================
true() != *
================================================================================
true() != *
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier))
  (path_expr
    (step_expr
      (name_test))))

================================================================================
false() = *
================================================================================
false() = *
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier))
  (path_expr
    (step_expr
      (name_test))))

================================================================================
false() != *
================================================================================
false() != *
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier))
  (path_expr
    (step_expr
      (name_test))))

================================================================================
0 = *
================================================================================
0 = *
--------------------------------------------------------------------------------

(query
  (integer_literal)
  (path_expr
    (step_expr
      (name_test))))

================================================================================
0 != *
================================================================================
0 != *
--------------------------------------------------------------------------------

(query
  (integer_literal)
  (path_expr
    (step_expr
      (name_test))))

================================================================================
'aaa' = *
================================================================================
'aaa' = *
--------------------------------------------------------------------------------

(query
  (string_literal)
  (path_expr
    (step_expr
      (name_test))))

================================================================================
'aaa' != *
================================================================================
'aaa' != *
--------------------------------------------------------------------------------

(query
  (string_literal)
  (path_expr
    (step_expr
      (name_test))))

================================================================================
'bb' = *
================================================================================
'bb' = *
--------------------------------------------------------------------------------

(query
  (string_literal)
  (path_expr
    (step_expr
      (name_test))))

================================================================================
'bb' != *
================================================================================
'bb' != *
--------------------------------------------------------------------------------

(query
  (string_literal)
  (path_expr
    (step_expr
      (name_test))))

================================================================================
'' = *
================================================================================
'' = *
--------------------------------------------------------------------------------

(query
  (string_literal)
  (path_expr
    (step_expr
      (name_test))))

================================================================================
'' != *
================================================================================
'' != *
--------------------------------------------------------------------------------

(query
  (string_literal)
  (path_expr
    (step_expr
      (name_test))))

================================================================================
-10 < *
================================================================================
-10 < *
--------------------------------------------------------------------------------

(query
  (integer_literal)
  (path_expr
    (step_expr
      (name_test))))

================================================================================
-10 <= *
================================================================================
-10 <= *
--------------------------------------------------------------------------------

(query
  (integer_literal)
  (path_expr
    (step_expr
      (name_test))))

================================================================================
-10 > *
================================================================================
-10 > *
--------------------------------------------------------------------------------

(query
  (integer_literal)
  (path_expr
    (step_expr
      (name_test))))

================================================================================
-10 >= *
================================================================================
-10 >= *
--------------------------------------------------------------------------------

(query
  (integer_literal)
  (path_expr
    (step_expr
      (name_test))))

================================================================================
10 < *
================================================================================
10 < *
--------------------------------------------------------------------------------

(query
  (integer_literal)
  (path_expr
    (step_expr
      (name_test))))

================================================================================
10 <= *
================================================================================
10 <= *
--------------------------------------------------------------------------------

(query
  (integer_literal)
  (path_expr
    (step_expr
      (name_test))))

================================================================================
10 > *
================================================================================
10 > *
--------------------------------------------------------------------------------

(query
  (integer_literal)
  (path_expr
    (step_expr
      (name_test))))

================================================================================
10 >= *
================================================================================
10 >= *
--------------------------------------------------------------------------------

(query
  (integer_literal)
  (path_expr
    (step_expr
      (name_test))))

================================================================================
5 < *
================================================================================
5 < *
--------------------------------------------------------------------------------

(query
  (integer_literal)
  (path_expr
    (step_expr
      (name_test))))

================================================================================
5 <= *
================================================================================
5 <= *
--------------------------------------------------------------------------------

(query
  (integer_literal)
  (path_expr
    (step_expr
      (name_test))))

================================================================================
5 > *
================================================================================
5 > *
--------------------------------------------------------------------------------

(query
  (integer_literal)
  (path_expr
    (step_expr
      (name_test))))

================================================================================
5 >= *
================================================================================
5 >= *
--------------------------------------------------------------------------------

(query
  (integer_literal)
  (path_expr
    (step_expr
      (name_test))))

================================================================================
2 < *
================================================================================
2 < *
--------------------------------------------------------------------------------

(query
  (integer_literal)
  (path_expr
    (step_expr
      (name_test))))

================================================================================
2 <= *
================================================================================
2 <= *
--------------------------------------------------------------------------------

(query
  (integer_literal)
  (path_expr
    (step_expr
      (name_test))))

================================================================================
2 > *
================================================================================
2 > *
--------------------------------------------------------------------------------

(query
  (integer_literal)
  (path_expr
    (step_expr
      (name_test))))

================================================================================
2 >= *
================================================================================
2 >= *
--------------------------------------------------------------------------------

(query
  (integer_literal)
  (path_expr
    (step_expr
      (name_test))))

================================================================================
true() < *
================================================================================
true() < *
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier))
  (path_expr
    (step_expr
      (name_test))))

================================================================================
true() <= *
================================================================================
true() <= *
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier))
  (path_expr
    (step_expr
      (name_test))))

================================================================================
true() > *
================================================================================
true() > *
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier))
  (path_expr
    (step_expr
      (name_test))))

================================================================================
true() >= *
================================================================================
true() >= *
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier))
  (path_expr
    (step_expr
      (name_test))))

================================================================================
false() < *
================================================================================
false() < *
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier))
  (path_expr
    (step_expr
      (name_test))))

================================================================================
false() <= *
================================================================================
false() <= *
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier))
  (path_expr
    (step_expr
      (name_test))))

================================================================================
false() > *
================================================================================
false() > *
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier))
  (path_expr
    (step_expr
      (name_test))))

================================================================================
false() >= *
================================================================================
false() >= *
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier))
  (path_expr
    (step_expr
      (name_test))))

================================================================================
'4' < *
================================================================================
'4' < *
--------------------------------------------------------------------------------

(query
  (string_literal)
  (path_expr
    (step_expr
      (name_test))))

================================================================================
'4' <= *
================================================================================
'4' <= *
--------------------------------------------------------------------------------

(query
  (string_literal)
  (path_expr
    (step_expr
      (name_test))))

================================================================================
'4' > *
================================================================================
'4' > *
--------------------------------------------------------------------------------

(query
  (string_literal)
  (path_expr
    (step_expr
      (name_test))))

================================================================================
'4' >= *
================================================================================
'4' >= *
--------------------------------------------------------------------------------

(query
  (string_literal)
  (path_expr
    (step_expr
      (name_test))))

================================================================================
* < -10
================================================================================
* < -10
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (integer_literal))

================================================================================
* <= -10
================================================================================
* <= -10
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (integer_literal))

================================================================================
* > -10
================================================================================
* > -10
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (integer_literal))

================================================================================
* >= -10
================================================================================
* >= -10
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (integer_literal))

================================================================================
* < 10
================================================================================
* < 10
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (integer_literal))

================================================================================
* <= 10
================================================================================
* <= 10
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (integer_literal))

================================================================================
* > 10
================================================================================
* > 10
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (integer_literal))

================================================================================
* >= 10
================================================================================
* >= 10
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (integer_literal))

================================================================================
* < 5
================================================================================
* < 5
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (integer_literal))

================================================================================
* <= 5
================================================================================
* <= 5
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (integer_literal))

================================================================================
* > 5
================================================================================
* > 5
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (integer_literal))

================================================================================
* >= 5
================================================================================
* >= 5
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (integer_literal))

================================================================================
* < 2
================================================================================
* < 2
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (integer_literal))

================================================================================
* <= 2
================================================================================
* <= 2
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (integer_literal))

================================================================================
* > 2
================================================================================
* > 2
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (integer_literal))

================================================================================
* >= 2
================================================================================
* >= 2
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (integer_literal))

================================================================================
* < true()
================================================================================
* < true()
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (function_call
    (identifier)))

================================================================================
* <= true()
================================================================================
* <= true()
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (function_call
    (identifier)))

================================================================================
* > true()
================================================================================
* > true()
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (function_call
    (identifier)))

================================================================================
* >= true()
================================================================================
* >= true()
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (function_call
    (identifier)))

================================================================================
* < false()
================================================================================
* < false()
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (function_call
    (identifier)))

================================================================================
* <= false()
================================================================================
* <= false()
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (function_call
    (identifier)))

================================================================================
* > false()
================================================================================
* > false()
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (function_call
    (identifier)))

================================================================================
* >= false()
================================================================================
* >= false()
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (function_call
    (identifier)))

================================================================================
* < '4'
================================================================================
* < '4'
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (string_literal))

================================================================================
* <= '4'
================================================================================
* <= '4'
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (string_literal))

================================================================================
* > '4'
================================================================================
* > '4'
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (string_literal))

================================================================================
* >= '4'
================================================================================
* >= '4'
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (string_literal))

================================================================================
* < 'aaa'
================================================================================
* < 'aaa'
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (string_literal))

================================================================================
* <= 'aaa'
================================================================================
* <= 'aaa'
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (string_literal))

================================================================================
* > 'aaa'
================================================================================
* > 'aaa'
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (string_literal))

================================================================================
* >= 'aaa'
================================================================================
* >= 'aaa'
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (string_literal))

================================================================================
'aaa' < *
================================================================================
'aaa' < *
--------------------------------------------------------------------------------

(query
  (string_literal)
  (path_expr
    (step_expr
      (name_test))))

================================================================================
'aaa' <= *
================================================================================
'aaa' <= *
--------------------------------------------------------------------------------

(query
  (string_literal)
  (path_expr
    (step_expr
      (name_test))))

================================================================================
'aaa' > *
================================================================================
'aaa' > *
--------------------------------------------------------------------------------

(query
  (string_literal)
  (path_expr
    (step_expr
      (name_test))))

================================================================================
'aaa' >= *
================================================================================
'aaa' >= *
--------------------------------------------------------------------------------

(query
  (string_literal)
  (path_expr
    (step_expr
      (name_test))))

================================================================================
0 < *
================================================================================
0 < *
--------------------------------------------------------------------------------

(query
  (integer_literal)
  (path_expr
    (step_expr
      (name_test))))

================================================================================
0 <= *
================================================================================
0 <= *
--------------------------------------------------------------------------------

(query
  (integer_literal)
  (path_expr
    (step_expr
      (name_test))))

================================================================================
0 > *
================================================================================
0 > *
--------------------------------------------------------------------------------

(query
  (integer_literal)
  (path_expr
    (step_expr
      (name_test))))

================================================================================
0 >= *
================================================================================
0 >= *
--------------------------------------------------------------------------------

(query
  (integer_literal)
  (path_expr
    (step_expr
      (name_test))))

================================================================================
'' < *
================================================================================
'' < *
--------------------------------------------------------------------------------

(query
  (string_literal)
  (path_expr
    (step_expr
      (name_test))))

================================================================================
'' <= *
================================================================================
'' <= *
--------------------------------------------------------------------------------

(query
  (string_literal)
  (path_expr
    (step_expr
      (name_test))))

================================================================================
'' > *
================================================================================
'' > *
--------------------------------------------------------------------------------

(query
  (string_literal)
  (path_expr
    (step_expr
      (name_test))))

================================================================================
'' >= *
================================================================================
'' >= *
--------------------------------------------------------------------------------

(query
  (string_literal)
  (path_expr
    (step_expr
      (name_test))))

================================================================================
* < 0
================================================================================
* < 0
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (integer_literal))

================================================================================
* <= 0
================================================================================
* <= 0
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (integer_literal))

================================================================================
* > 0
================================================================================
* > 0
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (integer_literal))

================================================================================
* >= 0
================================================================================
* >= 0
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (integer_literal))

================================================================================
* < ''
================================================================================
* < ''
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (string_literal))

================================================================================
* <= ''
================================================================================
* <= ''
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (string_literal))

================================================================================
* > ''
================================================================================
* > ''
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (string_literal))

================================================================================
* >= ''
================================================================================
* >= ''
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (string_literal))

================================================================================
* = -10
================================================================================
* = -10
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (integer_literal))

================================================================================
* = 4
================================================================================
* = 4
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (integer_literal))

================================================================================
* = 4.3
================================================================================
* = 4.3
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (decimal_literal))

================================================================================
* = 0
================================================================================
* = 0
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (integer_literal))

================================================================================
* = true()
================================================================================
* = true()
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (function_call
    (identifier)))

================================================================================
* = false()
================================================================================
* = false()
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (function_call
    (identifier)))

================================================================================
* = 'aaa'
================================================================================
* = 'aaa'
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (string_literal))

================================================================================
* = 'bb'
================================================================================
* = 'bb'
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (string_literal))

================================================================================
* = ''
================================================================================
* = ''
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (string_literal))

================================================================================
* != -10
================================================================================
* != -10
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (integer_literal))

================================================================================
* != 4
================================================================================
* != 4
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (integer_literal))

================================================================================
* != 4.3
================================================================================
* != 4.3
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (decimal_literal))

================================================================================
* != 0
================================================================================
* != 0
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (integer_literal))

================================================================================
* != true()
================================================================================
* != true()
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (function_call
    (identifier)))

================================================================================
* != false()
================================================================================
* != false()
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (function_call
    (identifier)))

================================================================================
* != 'aaa'
================================================================================
* != 'aaa'
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (string_literal))

================================================================================
* != 'bb'
================================================================================
* != 'bb'
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (string_literal))

================================================================================
* != ''
================================================================================
* != ''
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (string_literal))

================================================================================
id('ComparisonOperatorCaseNodesetNegative5to5')/* < id('ComparisonOperatorCaseNodesetEmpty')/*
================================================================================
id('ComparisonOperatorCaseNodesetNegative5to5')/* < id('ComparisonOperatorCaseNodesetEmpty')/*
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (id_function_call
        (string_literal)))
    (step_expr
      (name_test)))
  (path_expr
    (step_expr
      (id_function_call
        (string_literal)))
    (step_expr
      (name_test))))

================================================================================
id ('ComparisonOperatorCaseNodesetNegative5to5')/* < id( 'ComparisonOperatorCaseNodesetEmpty')/*
================================================================================
id ('ComparisonOperatorCaseNodesetNegative5to5')/* < id( 'ComparisonOperatorCaseNodesetEmpty')/*
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (id_function_call
        (string_literal)))
    (step_expr
      (name_test)))
  (path_expr
    (step_expr
      (id_function_call
        (string_literal)))
    (step_expr
      (name_test))))

================================================================================
id ( 'ComparisonOperatorCaseNodesetNegative5to5' )/* < id( 'ComparisonOperatorCaseNodesetEmpty' )/*
================================================================================
id ( 'ComparisonOperatorCaseNodesetNegative5to5' )/* < id( 'ComparisonOperatorCaseNodesetEmpty' )/*
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (id_function_call
        (string_literal)))
    (step_expr
      (name_test)))
  (path_expr
    (step_expr
      (id_function_call
        (string_literal)))
    (step_expr
      (name_test))))

================================================================================
id('ComparisonOperatorCaseNodesetNegative5to5')/* <= id('ComparisonOperatorCaseNodesetEmpty')/*
================================================================================
id('ComparisonOperatorCaseNodesetNegative5to5')/* <= id('ComparisonOperatorCaseNodesetEmpty')/*
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (id_function_call
        (string_literal)))
    (step_expr
      (name_test)))
  (path_expr
    (step_expr
      (id_function_call
        (string_literal)))
    (step_expr
      (name_test))))

================================================================================
id('ComparisonOperatorCaseNodesetNegative5to5')/* > id('ComparisonOperatorCaseNodesetEmpty')/*
================================================================================
id('ComparisonOperatorCaseNodesetNegative5to5')/* > id('ComparisonOperatorCaseNodesetEmpty')/*
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (id_function_call
        (string_literal)))
    (step_expr
      (name_test)))
  (path_expr
    (step_expr
      (id_function_call
        (string_literal)))
    (step_expr
      (name_test))))

================================================================================
id('ComparisonOperatorCaseNodesetNegative5to5')/* >= id('ComparisonOperatorCaseNodesetEmpty')/*
================================================================================
id('ComparisonOperatorCaseNodesetNegative5to5')/* >= id('ComparisonOperatorCaseNodesetEmpty')/*
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (id_function_call
        (string_literal)))
    (step_expr
      (name_test)))
  (path_expr
    (step_expr
      (id_function_call
        (string_literal)))
    (step_expr
      (name_test))))

================================================================================
id('ComparisonOperatorCaseNodesetNegative5to5')/* < id('ComparisonOperatorCaseNodeset4to8')/*
================================================================================
id('ComparisonOperatorCaseNodesetNegative5to5')/* < id('ComparisonOperatorCaseNodeset4to8')/*
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (id_function_call
        (string_literal)))
    (step_expr
      (name_test)))
  (path_expr
    (step_expr
      (id_function_call
        (string_literal)))
    (step_expr
      (name_test))))

================================================================================
id('ComparisonOperatorCaseNodesetNegative5to5')/* <= id('ComparisonOperatorCaseNodeset4to8')/*
================================================================================
id('ComparisonOperatorCaseNodesetNegative5to5')/* <= id('ComparisonOperatorCaseNodeset4to8')/*
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (id_function_call
        (string_literal)))
    (step_expr
      (name_test)))
  (path_expr
    (step_expr
      (id_function_call
        (string_literal)))
    (step_expr
      (name_test))))

================================================================================
id('ComparisonOperatorCaseNodesetNegative5to5')/* > id('ComparisonOperatorCaseNodeset4to8')/*
================================================================================
id('ComparisonOperatorCaseNodesetNegative5to5')/* > id('ComparisonOperatorCaseNodeset4to8')/*
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (id_function_call
        (string_literal)))
    (step_expr
      (name_test)))
  (path_expr
    (step_expr
      (id_function_call
        (string_literal)))
    (step_expr
      (name_test))))

================================================================================
id('ComparisonOperatorCaseNodesetNegative5to5')/* >= id('ComparisonOperatorCaseNodeset4to8')/*
================================================================================
id('ComparisonOperatorCaseNodesetNegative5to5')/* >= id('ComparisonOperatorCaseNodeset4to8')/*
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (id_function_call
        (string_literal)))
    (step_expr
      (name_test)))
  (path_expr
    (step_expr
      (id_function_call
        (string_literal)))
    (step_expr
      (name_test))))

================================================================================
id('ComparisonOperatorCaseNodesetNegative5to5')/* < id('ComparisonOperatorCaseNodeset6to10')/*
================================================================================
id('ComparisonOperatorCaseNodesetNegative5to5')/* < id('ComparisonOperatorCaseNodeset6to10')/*
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (id_function_call
        (string_literal)))
    (step_expr
      (name_test)))
  (path_expr
    (step_expr
      (id_function_call
        (string_literal)))
    (step_expr
      (name_test))))

================================================================================
id('ComparisonOperatorCaseNodesetNegative5to5')/* <= id('ComparisonOperatorCaseNodeset6to10')/*
================================================================================
id('ComparisonOperatorCaseNodesetNegative5to5')/* <= id('ComparisonOperatorCaseNodeset6to10')/*
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (id_function_call
        (string_literal)))
    (step_expr
      (name_test)))
  (path_expr
    (step_expr
      (id_function_call
        (string_literal)))
    (step_expr
      (name_test))))

================================================================================
id('ComparisonOperatorCaseNodesetNegative5to5')/* > id('ComparisonOperatorCaseNodeset6to10')/*
================================================================================
id('ComparisonOperatorCaseNodesetNegative5to5')/* > id('ComparisonOperatorCaseNodeset6to10')/*
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (id_function_call
        (string_literal)))
    (step_expr
      (name_test)))
  (path_expr
    (step_expr
      (id_function_call
        (string_literal)))
    (step_expr
      (name_test))))

================================================================================
id('ComparisonOperatorCaseNodesetNegative5to5')/* >= id('ComparisonOperatorCaseNodeset6to10')/*
================================================================================
id('ComparisonOperatorCaseNodesetNegative5to5')/* >= id('ComparisonOperatorCaseNodeset6to10')/*
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (id_function_call
        (string_literal)))
    (step_expr
      (name_test)))
  (path_expr
    (step_expr
      (id_function_call
        (string_literal)))
    (step_expr
      (name_test))))

================================================================================
/thedata/nodeA
================================================================================
/thedata/nodeA
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))))

================================================================================
/thedata/nodeB
================================================================================
/thedata/nodeB
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))))

================================================================================
/thedata/nodeC
================================================================================
/thedata/nodeC
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))))

================================================================================
/model/instance[1]/*//*[@template] | /model/instance[1]/*//*[@jr:template]
================================================================================
/model/instance[1]/*//*[@template] | /model/instance[1]/*//*[@jr:template]
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier))
      (predicate
        (integer_literal)))
    (step_expr
      (name_test))
    (step_expr
      (name_test)
      (predicate
        (path_expr
          (step_expr
            (abbrev_foward)
            (name_test
              (identifier)))))))
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier))
      (predicate
        (integer_literal)))
    (step_expr
      (name_test))
    (step_expr
      (name_test)
      (predicate
        (path_expr
          (step_expr
            (abbrev_foward)
            (name_test
              (identifier)
              (identifier))))))))

================================================================================
attribute::*
================================================================================
attribute::*
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test))))

================================================================================
child::*
================================================================================
child::*
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test))))

================================================================================
ancestor-or-self::*
================================================================================
ancestor-or-self::*
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test))))

================================================================================
attribute::attrib3
================================================================================
attribute::attrib3
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))))

================================================================================
child::html
================================================================================
child::html
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))))

================================================================================
child::xhtml:html
================================================================================
child::xhtml:html
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)
        (identifier)))))

================================================================================
ancestor::xhtml:div
================================================================================
ancestor::xhtml:div
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)
        (identifier)))))

================================================================================
ancestor::div
================================================================================
ancestor::div
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))))

================================================================================
id(.)
================================================================================
id(.)
--------------------------------------------------------------------------------

(query
  (id_function_call
    (context_item_expr)))

================================================================================
id(child::*)
================================================================================
id(child::*)
--------------------------------------------------------------------------------

(query
  (id_function_call
    (path_expr
      (step_expr
        (name_test)))))

================================================================================
local-name(/htmlnot)
================================================================================
local-name(/htmlnot)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier))))))

================================================================================
namespace-uri(/htmlnot)
================================================================================
namespace-uri(/htmlnot)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier))))))

================================================================================
name(/htmlnot)
================================================================================
name(/htmlnot)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier))))))

================================================================================
count(xhtml:p)
================================================================================
count(xhtml:p)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)
          (identifier))))))

================================================================================
1 + count(xhtml:p)
================================================================================
1 + count(xhtml:p)
--------------------------------------------------------------------------------

(query
  (integer_literal)
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)
          (identifier))))))

================================================================================
count(p)
================================================================================
count(p)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier))))))

================================================================================
1 + count(p)
================================================================================
1 + count(p)
--------------------------------------------------------------------------------

(query
  (integer_literal)
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier))))))

================================================================================
count(//nonexisting)
================================================================================
count(//nonexisting)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier))))))

================================================================================
1 + count(//nonexisting)
================================================================================
1 + count(//nonexisting)
--------------------------------------------------------------------------------

(query
  (integer_literal)
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier))))))

================================================================================
number(*)
================================================================================
number(*)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test)))))

================================================================================
sum(self::*)
================================================================================
sum(self::*)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test)))))

================================================================================
sum(*)
================================================================================
sum(*)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test)))))

================================================================================
/
================================================================================
/
--------------------------------------------------------------------------------

(query
  (path_expr))

================================================================================
/html
================================================================================
/html
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))))

================================================================================
/xhtml:html
================================================================================
/xhtml:html
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)
        (identifier)))))

================================================================================
/htmlnot
================================================================================
/htmlnot
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))))

================================================================================
/xhtml:html/xhtml:body
================================================================================
/xhtml:html/xhtml:body
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)
        (identifier)))
    (step_expr
      (name_test
        (identifier)
        (identifier)))))

================================================================================
xhtml:html
================================================================================
xhtml:html
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)
        (identifier)))))

================================================================================
xhtml:html/xhtml:body
================================================================================
xhtml:html/xhtml:body
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)
        (identifier)))
    (step_expr
      (name_test
        (identifier)
        (identifier)))))

================================================================================
child::*/attribute::*
================================================================================
child::*/attribute::*
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test))
    (step_expr
      (name_test))))

================================================================================
ancestor-or-self::* /ancestor-or-self::*
================================================================================
ancestor-or-self::* /ancestor-or-self::*
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (path_expr
    (step_expr
      (name_test))))

================================================================================
/ancestor-or-self::* ancestor-or-self::*
================================================================================
/ancestor-or-self::* ancestor-or-self::*
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test)))
  (path_expr
    (step_expr
      (name_test))))

================================================================================
string(namespace-uri(/*))
================================================================================
string(namespace-uri(/*))
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (function_call
      (identifier)
      (path_expr
        (step_expr
          (name_test))))))

================================================================================
translate( ., "abc", "ABC")
================================================================================
translate( ., "abc", "ABC")
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (context_item_expr)
    (string_literal)
    (string_literal)))

================================================================================
string(/htmlnot)
================================================================================
string(/htmlnot)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier))))))

================================================================================
id('nss25')/namespace::*
================================================================================
id('nss25')/namespace::*
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (id_function_call
        (string_literal)))
    (step_expr
      (name_test))))

================================================================================
id('nss25')/namespace::* | id('nss25')/attribute::*
================================================================================
id('nss25')/namespace::* | id('nss25')/attribute::*
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (id_function_call
        (string_literal)))
    (step_expr
      (name_test)))
  (path_expr
    (step_expr
      (id_function_call
        (string_literal)))
    (step_expr
      (name_test))))

================================================================================
id('nss40')/namespace::*
================================================================================
id('nss40')/namespace::*
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (id_function_call
        (string_literal)))
    (step_expr
      (name_test))))

================================================================================
id('nss40')/namespace::* | id('nss40')/namespace::*
================================================================================
id('nss40')/namespace::* | id('nss40')/namespace::*
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (id_function_call
        (string_literal)))
    (step_expr
      (name_test)))
  (path_expr
    (step_expr
      (id_function_call
        (string_literal)))
    (step_expr
      (name_test))))

================================================================================
id('nss40')/namespace::* | id('nss25')/attribute::* | id('nss25')
================================================================================
id('nss40')/namespace::* | id('nss25')/attribute::* | id('nss25')
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (id_function_call
        (string_literal)))
    (step_expr
      (name_test)))
  (path_expr
    (step_expr
      (id_function_call
        (string_literal)))
    (step_expr
      (name_test)))
  (id_function_call
    (string_literal)))

================================================================================
/div/div/div/div/div|id('eee20')
================================================================================
/div/div/div/div/div|id('eee20')
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier))))
  (id_function_call
    (string_literal)))

================================================================================
id('eee40')/attribute::*
================================================================================
id('eee40')/attribute::*
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (id_function_call
        (string_literal)))
    (step_expr
      (name_test))))

================================================================================
/div
================================================================================
/div
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))))

================================================================================
area(./*)
================================================================================
area(./*)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (context_item_expr))
      (step_expr
        (name_test)))))

================================================================================
distance(./*)
================================================================================
distance(./*)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (context_item_expr))
      (step_expr
        (name_test)))))

================================================================================
area(.)
================================================================================
area(.)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (context_item_expr)))

================================================================================
distance(.)
================================================================================
distance(.)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (context_item_expr)))

================================================================================
checklist(2, 2, * )
================================================================================
checklist(2, 2, * )
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (integer_literal)
    (integer_literal)
    (path_expr
      (step_expr
        (name_test)))))

================================================================================
coalesce(/simple/xpath/to/node, "whatever")
================================================================================
coalesce(/simple/xpath/to/node, "whatever")
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))
    (string_literal)))

================================================================================
coalesce("", /simple/xpath/to/node)
================================================================================
coalesce("", /simple/xpath/to/node)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (string_literal)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
coalesce(/simple/empty, /simple/xpath/to/node)
================================================================================
coalesce(/simple/empty, /simple/xpath/to/node)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
coalesce(/simple/xpath/to/node, "SECOND")
================================================================================
coalesce(/simple/xpath/to/node, "SECOND")
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))
    (string_literal)))

================================================================================
coalesce(self::*, 'ab')
================================================================================
coalesce(self::*, 'ab')
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test)))
    (string_literal)))

================================================================================
coalesce(self::*, 'cd')
================================================================================
coalesce(self::*, 'cd')
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test)))
    (string_literal)))

================================================================================
concat(/simple/xpath/to/node, /simple/xpath/to/node)
================================================================================
concat(/simple/xpath/to/node, /simple/xpath/to/node)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
concat(/simple/xpath/to/node, "manteau")
================================================================================
concat(/simple/xpath/to/node, "manteau")
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))
    (string_literal)))

================================================================================
concat(*, 'a')
================================================================================
concat(*, 'a')
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test)))
    (string_literal)))

================================================================================
concat(*)
================================================================================
concat(*)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test)))))

================================================================================
@id="FunctionCountNonEmpty"
================================================================================
@id="FunctionCountNonEmpty"
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (abbrev_foward)
      (name_test
        (identifier))))
  (string_literal))

================================================================================
@id="NoExist"
================================================================================
@id="NoExist"
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (abbrev_foward)
      (name_test
        (identifier))))
  (string_literal))

================================================================================
. < date('2012-07-24')
================================================================================
. < date('2012-07-24')
--------------------------------------------------------------------------------

(query
  (context_item_expr)
  (function_call
    (identifier)
    (string_literal)))

================================================================================
. < date-time('2012-07-24')
================================================================================
. < date-time('2012-07-24')
--------------------------------------------------------------------------------

(query
  (context_item_expr)
  (function_call
    (identifier)
    (string_literal)))

================================================================================
@id='FunctionDateCase2'
================================================================================
@id='FunctionDateCase2'
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (abbrev_foward)
      (name_test
        (identifier))))
  (string_literal))

================================================================================
@id='FunctionDateCase3'
================================================================================
@id='FunctionDateCase3'
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (abbrev_foward)
      (name_test
        (identifier))))
  (string_literal))

================================================================================
. = date('2012-07-24') - 1
================================================================================
. = date('2012-07-24') - 1
--------------------------------------------------------------------------------

(query
  (context_item_expr)
  (function_call
    (identifier)
    (string_literal))
  (integer_literal))

================================================================================
. = date-time('2012-07-24') - 1
================================================================================
. = date-time('2012-07-24') - 1
--------------------------------------------------------------------------------

(query
  (context_item_expr)
  (function_call
    (identifier)
    (string_literal))
  (integer_literal))

================================================================================
. > date('2012-07-24') - 2
================================================================================
. > date('2012-07-24') - 2
--------------------------------------------------------------------------------

(query
  (context_item_expr)
  (function_call
    (identifier)
    (string_literal))
  (integer_literal))

================================================================================
. > date-time('2012-07-24') - 2
================================================================================
. > date-time('2012-07-24') - 2
--------------------------------------------------------------------------------

(query
  (context_item_expr)
  (function_call
    (identifier)
    (string_literal))
  (integer_literal))

================================================================================
. < date('2012-07-25') - 1
================================================================================
. < date('2012-07-25') - 1
--------------------------------------------------------------------------------

(query
  (context_item_expr)
  (function_call
    (identifier)
    (string_literal))
  (integer_literal))

================================================================================
. < date-time('2012-07-25') - 1
================================================================================
. < date-time('2012-07-25') - 1
--------------------------------------------------------------------------------

(query
  (context_item_expr)
  (function_call
    (identifier)
    (string_literal))
  (integer_literal))

================================================================================
@id='FunctionDate'
================================================================================
@id='FunctionDate'
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (abbrev_foward)
      (name_test
        (identifier))))
  (string_literal))

================================================================================
@id='FunctionDateCase4'
================================================================================
@id='FunctionDateCase4'
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (abbrev_foward)
      (name_test
        (identifier))))
  (string_literal))

================================================================================
decimal-time( /data/a )
================================================================================
decimal-time( /data/a )
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
ends-with( /data/a, "cab")
================================================================================
ends-with( /data/a, "cab")
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))
    (string_literal)))

================================================================================
format-date(.,  "%Y/%n | %y/%m | %b" )
================================================================================
format-date(.,  "%Y/%n | %y/%m | %b" )
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (context_item_expr)
    (string_literal)))

================================================================================
format-date-time(.,  "%Y/%n | %y/%m | %b" )
================================================================================
format-date-time(.,  "%Y/%n | %y/%m | %b" )
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (context_item_expr)
    (string_literal)))

================================================================================
format-date(., "%Y/%n | %y/%m | %b" )
================================================================================
format-date(., "%Y/%n | %y/%m | %b" )
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (context_item_expr)
    (string_literal)))

================================================================================
format-date-time(., "%Y/%n | %y/%m | %b" )
================================================================================
format-date-time(., "%Y/%n | %y/%m | %b" )
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (context_item_expr)
    (string_literal)))

================================================================================
format-date(., "%M | %S | %3")
================================================================================
format-date(., "%M | %S | %3")
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (context_item_expr)
    (string_literal)))

================================================================================
format-date-time(., "%M | %S | %3")
================================================================================
format-date-time(., "%M | %S | %3")
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (context_item_expr)
    (string_literal)))

================================================================================
if(/unreal, "exists", "does not exist")
================================================================================
if(/unreal, "exists", "does not exist")
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier))))
    (string_literal)
    (string_literal)))

================================================================================
if(. != "0" and /div/div[@id="FunctionCheckListCaseEmpty"] != "", "yes", "no")
================================================================================
if(. != "0" and /div/div[@id="FunctionCheckListCaseEmpty"] != "", "yes", "no")
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (context_item_expr)
    (string_literal)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))
        (predicate
          (path_expr
            (step_expr
              (abbrev_foward)
              (name_test
                (identifier))))
          (string_literal))))
    (string_literal)
    (string_literal)
    (string_literal)))

================================================================================
@id="FunctionCheckListCaseEmpty"
================================================================================
@id="FunctionCheckListCaseEmpty"
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (abbrev_foward)
      (name_test
        (identifier))))
  (string_literal))

================================================================================
@id="FunctionChecklistCaseNo"
================================================================================
@id="FunctionChecklistCaseNo"
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (abbrev_foward)
      (name_test
        (identifier))))
  (string_literal))

================================================================================
if(. = "0" or /div/div[@id="FunctionCheckListCaseEmpty"] != "", "yes", "no")
================================================================================
if(. = "0" or /div/div[@id="FunctionCheckListCaseEmpty"] != "", "yes", "no")
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (context_item_expr)
    (string_literal)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))
        (predicate
          (path_expr
            (step_expr
              (abbrev_foward)
              (name_test
                (identifier))))
          (string_literal))))
    (string_literal)
    (string_literal)
    (string_literal)))

================================================================================
if( /model/instance[1]/data/page-welcome/GRP_ELIG/AGE_IC ="1" and /model/instance[1]/data/page-welcome/GRP_ELIG/INC_TEMP ="1" and /model/instance[1]/data/page-welcome/GRP_ELIG/NO_SEV_ILLNESS ="1" and /model/instance[1]/data/page-welcome/GRP_ELIG/FU_POSSIBLE ="1" and /model/instance[1]/data/page-welcome/GRP_ELIG/SAMPLE_COL_POSSIBLE ="1" and /model/instance[1]/data/page-welcome/GRP_ELIG/PROVIDE_INFORM_CONSENT ="1" and /model/instance[1]/data/page-welcome/GRP_ELIG/FEVER_RESP ="1", "Eligible", if( /model/instance[1]/data/page-welcome/GRP_ELIG/AGE_IC ="0" or /model/instance[1]/data/page-welcome/GRP_ELIG/INC_TEMP ="0" or /model/instance[1]/data/page-welcome/GRP_ELIG/NO_SEV_ILLNESS ="0" or /model/instance[1]/data/page-welcome/GRP_ELIG/FU_POSSIBLE ="0" or /model/instance[1]/data/page-welcome/GRP_ELIG/SAMPLE_COL_POSSIBLE ="0" or /model/instance[1]/data/page-welcome/GRP_ELIG/PROVIDE_INFORM_CONSENT ="0" or /model/instance[1]/data/page-welcome/GRP_ELIG/FEVER_RESP ="0", "Not-Eligible", "nothing"))
================================================================================
if( /model/instance[1]/data/page-welcome/GRP_ELIG/AGE_IC ="1" and /model/instance[1]/data/page-welcome/GRP_ELIG/INC_TEMP ="1" and /model/instance[1]/data/page-welcome/GRP_ELIG/NO_SEV_ILLNESS ="1" and /model/instance[1]/data/page-welcome/GRP_ELIG/FU_POSSIBLE ="1" and /model/instance[1]/data/page-welcome/GRP_ELIG/SAMPLE_COL_POSSIBLE ="1" and /model/instance[1]/data/page-welcome/GRP_ELIG/PROVIDE_INFORM_CONSENT ="1" and /model/instance[1]/data/page-welcome/GRP_ELIG/FEVER_RESP ="1", "Eligible", if( /model/instance[1]/data/page-welcome/GRP_ELIG/AGE_IC ="0" or /model/instance[1]/data/page-welcome/GRP_ELIG/INC_TEMP ="0" or /model/instance[1]/data/page-welcome/GRP_ELIG/NO_SEV_ILLNESS ="0" or /model/instance[1]/data/page-welcome/GRP_ELIG/FU_POSSIBLE ="0" or /model/instance[1]/data/page-welcome/GRP_ELIG/SAMPLE_COL_POSSIBLE ="0" or /model/instance[1]/data/page-welcome/GRP_ELIG/PROVIDE_INFORM_CONSENT ="0" or /model/instance[1]/data/page-welcome/GRP_ELIG/FEVER_RESP ="0", "Not-Eligible", "nothing"))
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))
        (predicate
          (integer_literal)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))
    (string_literal)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))
        (predicate
          (integer_literal)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))
    (string_literal)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))
        (predicate
          (integer_literal)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))
    (string_literal)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))
        (predicate
          (integer_literal)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))
    (string_literal)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))
        (predicate
          (integer_literal)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))
    (string_literal)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))
        (predicate
          (integer_literal)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))
    (string_literal)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))
        (predicate
          (integer_literal)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))
    (string_literal)
    (string_literal)
    (function_call
      (identifier)
      (path_expr
        (step_expr
          (name_test
            (identifier)))
        (step_expr
          (name_test
            (identifier))
          (predicate
            (integer_literal)))
        (step_expr
          (name_test
            (identifier)))
        (step_expr
          (name_test
            (identifier)))
        (step_expr
          (name_test
            (identifier)))
        (step_expr
          (name_test
            (identifier))))
      (string_literal)
      (path_expr
        (step_expr
          (name_test
            (identifier)))
        (step_expr
          (name_test
            (identifier))
          (predicate
            (integer_literal)))
        (step_expr
          (name_test
            (identifier)))
        (step_expr
          (name_test
            (identifier)))
        (step_expr
          (name_test
            (identifier)))
        (step_expr
          (name_test
            (identifier))))
      (string_literal)
      (path_expr
        (step_expr
          (name_test
            (identifier)))
        (step_expr
          (name_test
            (identifier))
          (predicate
            (integer_literal)))
        (step_expr
          (name_test
            (identifier)))
        (step_expr
          (name_test
            (identifier)))
        (step_expr
          (name_test
            (identifier)))
        (step_expr
          (name_test
            (identifier))))
      (string_literal)
      (path_expr
        (step_expr
          (name_test
            (identifier)))
        (step_expr
          (name_test
            (identifier))
          (predicate
            (integer_literal)))
        (step_expr
          (name_test
            (identifier)))
        (step_expr
          (name_test
            (identifier)))
        (step_expr
          (name_test
            (identifier)))
        (step_expr
          (name_test
            (identifier))))
      (string_literal)
      (path_expr
        (step_expr
          (name_test
            (identifier)))
        (step_expr
          (name_test
            (identifier))
          (predicate
            (integer_literal)))
        (step_expr
          (name_test
            (identifier)))
        (step_expr
          (name_test
            (identifier)))
        (step_expr
          (name_test
            (identifier)))
        (step_expr
          (name_test
            (identifier))))
      (string_literal)
      (path_expr
        (step_expr
          (name_test
            (identifier)))
        (step_expr
          (name_test
            (identifier))
          (predicate
            (integer_literal)))
        (step_expr
          (name_test
            (identifier)))
        (step_expr
          (name_test
            (identifier)))
        (step_expr
          (name_test
            (identifier)))
        (step_expr
          (name_test
            (identifier))))
      (string_literal)
      (path_expr
        (step_expr
          (name_test
            (identifier)))
        (step_expr
          (name_test
            (identifier))
          (predicate
            (integer_literal)))
        (step_expr
          (name_test
            (identifier)))
        (step_expr
          (name_test
            (identifier)))
        (step_expr
          (name_test
            (identifier)))
        (step_expr
          (name_test
            (identifier))))
      (string_literal)
      (string_literal)
      (string_literal))))

================================================================================
if( /data/a ="1" and /data/b ="1", "Eligible", if( /data/a ="0" or /data/b ="0", "Not-Eligible", "nothing"))
================================================================================
if( /data/a ="1" and /data/b ="1", "Eligible", if( /data/a ="0" or /data/b ="0", "Not-Eligible", "nothing"))
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))
    (string_literal)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))
    (string_literal)
    (string_literal)
    (function_call
      (identifier)
      (path_expr
        (step_expr
          (name_test
            (identifier)))
        (step_expr
          (name_test
            (identifier))))
      (string_literal)
      (path_expr
        (step_expr
          (name_test
            (identifier)))
        (step_expr
          (name_test
            (identifier))))
      (string_literal)
      (string_literal)
      (string_literal))))

================================================================================
if( /data/a ="1" and /data/c ="1", "Eligible", if( /data/a ="0" or /data/b ="0", "Not-Eligible", "nothing"))
================================================================================
if( /data/a ="1" and /data/c ="1", "Eligible", if( /data/a ="0" or /data/b ="0", "Not-Eligible", "nothing"))
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))
    (string_literal)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))
    (string_literal)
    (string_literal)
    (function_call
      (identifier)
      (path_expr
        (step_expr
          (name_test
            (identifier)))
        (step_expr
          (name_test
            (identifier))))
      (string_literal)
      (path_expr
        (step_expr
          (name_test
            (identifier)))
        (step_expr
          (name_test
            (identifier))))
      (string_literal)
      (string_literal)
      (string_literal))))

================================================================================
if( /data/c ="1" and /data/b ="1", "Eligible", if( /data/a ="0" or /data/b ="0", "Not-Eligible", "nothing"))
================================================================================
if( /data/c ="1" and /data/b ="1", "Eligible", if( /data/a ="0" or /data/b ="0", "Not-Eligible", "nothing"))
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))
    (string_literal)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))
    (string_literal)
    (string_literal)
    (function_call
      (identifier)
      (path_expr
        (step_expr
          (name_test
            (identifier)))
        (step_expr
          (name_test
            (identifier))))
      (string_literal)
      (path_expr
        (step_expr
          (name_test
            (identifier)))
        (step_expr
          (name_test
            (identifier))))
      (string_literal)
      (string_literal)
      (string_literal))))

================================================================================
if( /data/a ="1" and /data/b ="1", "Eligible", if( /data/a ="0" or /data/d ="0", "Not-Eligible", "nothing"))
================================================================================
if( /data/a ="1" and /data/b ="1", "Eligible", if( /data/a ="0" or /data/d ="0", "Not-Eligible", "nothing"))
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))
    (string_literal)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))
    (string_literal)
    (string_literal)
    (function_call
      (identifier)
      (path_expr
        (step_expr
          (name_test
            (identifier)))
        (step_expr
          (name_test
            (identifier))))
      (string_literal)
      (path_expr
        (step_expr
          (name_test
            (identifier)))
        (step_expr
          (name_test
            (identifier))))
      (string_literal)
      (string_literal)
      (string_literal))))

================================================================================
if( /data/a ="1" and /data/b ="1", "Eligible", if( /data/d ="0" or /data/b ="0", "Not-Eligible", "nothing"))
================================================================================
if( /data/a ="1" and /data/b ="1", "Eligible", if( /data/d ="0" or /data/b ="0", "Not-Eligible", "nothing"))
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))
    (string_literal)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))
    (string_literal)
    (string_literal)
    (function_call
      (identifier)
      (path_expr
        (step_expr
          (name_test
            (identifier)))
        (step_expr
          (name_test
            (identifier))))
      (string_literal)
      (path_expr
        (step_expr
          (name_test
            (identifier)))
        (step_expr
          (name_test
            (identifier))))
      (string_literal)
      (string_literal)
      (string_literal))))

================================================================================
count( if(true(), //b, //a ))
================================================================================
count( if(true(), //b, //a ))
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (function_call
      (identifier)
      (function_call
        (identifier))
      (path_expr
        (step_expr
          (name_test
            (identifier))))
      (path_expr
        (step_expr
          (name_test
            (identifier)))))))

================================================================================
count ( if(true(), //b, //a ))
================================================================================
count ( if(true(), //b, //a ))
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (function_call
      (identifier)
      (function_call
        (identifier))
      (path_expr
        (step_expr
          (name_test
            (identifier))))
      (path_expr
        (step_expr
          (name_test
            (identifier)))))))

================================================================================
some-fn ( if(true(), //b, //a ))
================================================================================
some-fn ( if(true(), //b, //a ))
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (function_call
      (identifier)
      (function_call
        (identifier))
      (path_expr
        (step_expr
          (name_test
            (identifier))))
      (path_expr
        (step_expr
          (name_test
            (identifier)))))))

================================================================================
int(/simple/xpath/to/node)
================================================================================
int(/simple/xpath/to/node)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
join(" :: ", //item)
================================================================================
join(" :: ", //item)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (string_literal)
    (path_expr
      (step_expr
        (name_test
          (identifier))))))

================================================================================
join(", ", //item)
================================================================================
join(", ", //item)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (string_literal)
    (path_expr
      (step_expr
        (name_test
          (identifier))))))

================================================================================
join(", ", /root/*)
================================================================================
join(", ", /root/*)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (string_literal)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test)))))

================================================================================
join(", ", *)
================================================================================
join(", ", *)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (string_literal)
    (path_expr
      (step_expr
        (name_test)))))

================================================================================
max(//nonexisting)
================================================================================
max(//nonexisting)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier))))))

================================================================================
max(/simple)
================================================================================
max(/simple)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier))))))

================================================================================
max(/simple/xpath/to/node)
================================================================================
max(/simple/xpath/to/node)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
max(/root/item)
================================================================================
max(/root/item)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
max(self::*)
================================================================================
max(self::*)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test)))))

================================================================================
max(*)
================================================================================
max(*)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test)))))

================================================================================
min(//nonexisting)
================================================================================
min(//nonexisting)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier))))))

================================================================================
min(/simple)
================================================================================
min(/simple)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier))))))

================================================================================
min(/simple/xpath/to/node)
================================================================================
min(/simple/xpath/to/node)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
min(/root/item)
================================================================================
min(/root/item)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
min(self::*)
================================================================================
min(self::*)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test)))))

================================================================================
min(*)
================================================================================
min(*)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test)))))

================================================================================
not(/cities)
================================================================================
not(/cities)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier))))))

================================================================================
not(not(/cities))
================================================================================
not(not(/cities))
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (function_call
      (identifier)
      (path_expr
        (step_expr
          (name_test
            (identifier)))))))

================================================================================
not(/countries)
================================================================================
not(/countries)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier))))))

================================================================================
not(not(/countries))
================================================================================
not(not(/countries))
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (function_call
      (identifier)
      (path_expr
        (step_expr
          (name_test
            (identifier)))))))

================================================================================
once(. * 10)
================================================================================
once(. * 10)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (context_item_expr)
    (integer_literal)))

================================================================================
position(..)
================================================================================
position(..)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (abbrev_reverse)))))

================================================================================
position(.)
================================================================================
position(.)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (context_item_expr)))

================================================================================
position(../..)
================================================================================
position(../..)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (abbrev_reverse))
      (step_expr
        (abbrev_reverse)))))

================================================================================
pow(/simple/xpath/to/node, 0)
================================================================================
pow(/simple/xpath/to/node, 0)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))
    (integer_literal)))

================================================================================
pow(/simple/xpath/to/node, 3)
================================================================================
pow(/simple/xpath/to/node, 3)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))
    (integer_literal)))

================================================================================
pow(/simple/xpath/to/node, 2)
================================================================================
pow(/simple/xpath/to/node, 2)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))
    (integer_literal)))

================================================================================
@id="FunctionRandomize"
================================================================================
@id="FunctionRandomize"
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (abbrev_foward)
      (name_test
        (identifier))))
  (string_literal))

================================================================================
@id="testFunctionNodeset2"
================================================================================
@id="testFunctionNodeset2"
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (abbrev_foward)
      (name_test
        (identifier))))
  (string_literal))

================================================================================
@id="crop_list"
================================================================================
@id="crop_list"
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (abbrev_foward)
      (name_test
        (identifier))))
  (string_literal))

================================================================================
regex(/simple/xpath/to/node, "[0-9]{3}")
================================================================================
regex(/simple/xpath/to/node, "[0-9]{3}")
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))
    (string_literal)))

================================================================================
selected(/simple/xpath/to/node, "one")
================================================================================
selected(/simple/xpath/to/node, "one")
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))
    (string_literal)))

================================================================================
selected(/simple/xpath/to/node, "two")
================================================================================
selected(/simple/xpath/to/node, "two")
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))
    (string_literal)))

================================================================================
selected(/simple/xpath/to/node, "three")
================================================================================
selected(/simple/xpath/to/node, "three")
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))
    (string_literal)))

================================================================================
selected(/simple/xpath/to/node, "on")
================================================================================
selected(/simple/xpath/to/node, "on")
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))
    (string_literal)))

================================================================================
selected(/simple/xpath/to/node, "ne")
================================================================================
selected(/simple/xpath/to/node, "ne")
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))
    (string_literal)))

================================================================================
selected(/simple/xpath/to/node, "four")
================================================================================
selected(/simple/xpath/to/node, "four")
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))
    (string_literal)))

================================================================================
/simple/xpath/to/node
================================================================================
/simple/xpath/to/node
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))))

================================================================================
substr(/simple/xpath/to/node, 5)
================================================================================
substr(/simple/xpath/to/node, 5)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))
    (integer_literal)))

================================================================================
substr(/simple/xpath/to/node, 2, 4)
================================================================================
substr(/simple/xpath/to/node, 2, 4)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))
    (integer_literal)
    (integer_literal)))

================================================================================
sum(/root/item)
================================================================================
sum(/root/item)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
sin(/numbers/minusone)
================================================================================
sin(/numbers/minusone)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
sin(/numbers/minuspointfive)
================================================================================
sin(/numbers/minuspointfive)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
sin(/numbers/zero)
================================================================================
sin(/numbers/zero)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
sin(/numbers/pointfive)
================================================================================
sin(/numbers/pointfive)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
sin(/numbers/one)
================================================================================
sin(/numbers/one)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
sin(/numbers/nan)
================================================================================
sin(/numbers/nan)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
sin(/numbers/missing)
================================================================================
sin(/numbers/missing)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
cos(/numbers/minusone)
================================================================================
cos(/numbers/minusone)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
cos(/numbers/minuspointfive)
================================================================================
cos(/numbers/minuspointfive)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
cos(/numbers/zero)
================================================================================
cos(/numbers/zero)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
cos(/numbers/pointfive)
================================================================================
cos(/numbers/pointfive)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
cos(/numbers/one)
================================================================================
cos(/numbers/one)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
cos(/numbers/nan)
================================================================================
cos(/numbers/nan)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
cos(/numbers/missing)
================================================================================
cos(/numbers/missing)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
tan(/numbers/minuspointfive)
================================================================================
tan(/numbers/minuspointfive)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
tan(/numbers/zero)
================================================================================
tan(/numbers/zero)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
tan(/numbers/pointfive)
================================================================================
tan(/numbers/pointfive)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
tan(/numbers/nan)
================================================================================
tan(/numbers/nan)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
tan(/numbers/missing)
================================================================================
tan(/numbers/missing)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
asin(/numbers/minusone)
================================================================================
asin(/numbers/minusone)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
asin(/numbers/minuspointfive)
================================================================================
asin(/numbers/minuspointfive)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
asin(/numbers/zero)
================================================================================
asin(/numbers/zero)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
asin(/numbers/pointfive)
================================================================================
asin(/numbers/pointfive)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
asin(/numbers/one)
================================================================================
asin(/numbers/one)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
asin(/numbers/nan)
================================================================================
asin(/numbers/nan)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
asin(/numbers/missing)
================================================================================
asin(/numbers/missing)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
acos(/numbers/minusone)
================================================================================
acos(/numbers/minusone)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
acos(/numbers/minuspointfive)
================================================================================
acos(/numbers/minuspointfive)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
acos(/numbers/zero)
================================================================================
acos(/numbers/zero)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
acos(/numbers/pointfive)
================================================================================
acos(/numbers/pointfive)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
acos(/numbers/one)
================================================================================
acos(/numbers/one)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
acos(/numbers/nan)
================================================================================
acos(/numbers/nan)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
acos(/numbers/missing)
================================================================================
acos(/numbers/missing)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
atan(/numbers/minusone)
================================================================================
atan(/numbers/minusone)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
atan(/numbers/minuspointfive)
================================================================================
atan(/numbers/minuspointfive)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
atan(/numbers/zero)
================================================================================
atan(/numbers/zero)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
atan(/numbers/pointfive)
================================================================================
atan(/numbers/pointfive)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
atan(/numbers/one)
================================================================================
atan(/numbers/one)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
atan(/numbers/nan)
================================================================================
atan(/numbers/nan)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
atan(/numbers/missing)
================================================================================
atan(/numbers/missing)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
log(/numbers/minusone)
================================================================================
log(/numbers/minusone)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
log(/numbers/minuspointfive)
================================================================================
log(/numbers/minuspointfive)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
log(/numbers/zero)
================================================================================
log(/numbers/zero)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
log(/numbers/pointfive)
================================================================================
log(/numbers/pointfive)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
log(/numbers/one)
================================================================================
log(/numbers/one)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
log(/numbers/nan)
================================================================================
log(/numbers/nan)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
log(/numbers/missing)
================================================================================
log(/numbers/missing)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
log10(/numbers/minusone)
================================================================================
log10(/numbers/minusone)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
log10(/numbers/minuspointfive)
================================================================================
log10(/numbers/minuspointfive)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
log10(/numbers/zero)
================================================================================
log10(/numbers/zero)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
log10(/numbers/pointfive)
================================================================================
log10(/numbers/pointfive)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
log10(/numbers/one)
================================================================================
log10(/numbers/one)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
log10(/numbers/nan)
================================================================================
log10(/numbers/nan)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
log10(/numbers/missing)
================================================================================
log10(/numbers/missing)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
exp(/numbers/minusone)
================================================================================
exp(/numbers/minusone)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
exp(/numbers/minuspointfive)
================================================================================
exp(/numbers/minuspointfive)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
exp(/numbers/zero)
================================================================================
exp(/numbers/zero)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
exp(/numbers/pointfive)
================================================================================
exp(/numbers/pointfive)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
exp(/numbers/one)
================================================================================
exp(/numbers/one)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
exp(/numbers/nan)
================================================================================
exp(/numbers/nan)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
exp(/numbers/missing)
================================================================================
exp(/numbers/missing)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
exp10(/numbers/minusone)
================================================================================
exp10(/numbers/minusone)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
exp10(/numbers/minuspointfive)
================================================================================
exp10(/numbers/minuspointfive)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
exp10(/numbers/zero)
================================================================================
exp10(/numbers/zero)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
exp10(/numbers/pointfive)
================================================================================
exp10(/numbers/pointfive)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
exp10(/numbers/one)
================================================================================
exp10(/numbers/one)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
exp10(/numbers/nan)
================================================================================
exp10(/numbers/nan)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
exp10(/numbers/missing)
================================================================================
exp10(/numbers/missing)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
sqrt(/numbers/minusone)
================================================================================
sqrt(/numbers/minusone)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
sqrt(/numbers/minuspointfive)
================================================================================
sqrt(/numbers/minuspointfive)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
sqrt(/numbers/zero)
================================================================================
sqrt(/numbers/zero)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
sqrt(/numbers/pointfive)
================================================================================
sqrt(/numbers/pointfive)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
sqrt(/numbers/one)
================================================================================
sqrt(/numbers/one)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
sqrt(/numbers/nan)
================================================================================
sqrt(/numbers/nan)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
sqrt(/numbers/missing)
================================================================================
sqrt(/numbers/missing)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
uuid(/numbers/one)
================================================================================
uuid(/numbers/one)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
uuid(/numbers/two)
================================================================================
uuid(/numbers/two)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
uuid(/numbers/six)
================================================================================
uuid(/numbers/six)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
uuid(/numbers/ninetynine)
================================================================================
uuid(/numbers/ninetynine)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
weighted-checklist(5, 5, self::* ,5)
================================================================================
weighted-checklist(5, 5, self::* ,5)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (integer_literal)
    (integer_literal)
    (path_expr
      (step_expr
        (name_test)))
    (integer_literal)))

================================================================================
weighted-checklist(9, 9, /thedata/somenodes/*, /thedata/someweights/*)
================================================================================
weighted-checklist(9, 9, /thedata/somenodes/*, /thedata/someweights/*)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (integer_literal)
    (integer_literal)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test)))
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test)))))

================================================================================
weighted-checklist(8, 8, /thedata/somenodes/*, /thedata/someweights/*)
================================================================================
weighted-checklist(8, 8, /thedata/somenodes/*, /thedata/someweights/*)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (integer_literal)
    (integer_literal)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test)))
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test)))))

================================================================================
weighted-checklist(10, 10, /thedata/somenodes/*, /thedata/someweights/*)
================================================================================
weighted-checklist(10, 10, /thedata/somenodes/*, /thedata/someweights/*)
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (integer_literal)
    (integer_literal)
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test)))
    (path_expr
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test)))))

================================================================================
@id="cities"
================================================================================
@id="cities"
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (abbrev_foward)
      (name_test
        (identifier))))
  (string_literal))

================================================================================
/data/a[selected("a b", "a")]
================================================================================
/data/a[selected("a b", "a")]
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier))
      (predicate
        (function_call
          (identifier)
          (string_literal)
          (string_literal))))))

================================================================================
../name/first = string-length(../name/last)
================================================================================
../name/first = string-length(../name/last)
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (abbrev_reverse))
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier))))
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (abbrev_reverse))
      (step_expr
        (name_test
          (identifier)))
      (step_expr
        (name_test
          (identifier))))))

================================================================================
@id="3"
================================================================================
@id="3"
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (abbrev_foward)
      (name_test
        (identifier))))
  (string_literal))

================================================================================
/data/c[@id="3"] and /data/a[@id="1"]
================================================================================
/data/c[@id="3"] and /data/a[@id="1"]
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier))
      (predicate
        (path_expr
          (step_expr
            (abbrev_foward)
            (name_test
              (identifier))))
        (string_literal))))
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier))
      (predicate
        (path_expr
          (step_expr
            (abbrev_foward)
            (name_test
              (identifier))))
        (string_literal)))))

================================================================================
@id="1"
================================================================================
@id="1"
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (abbrev_foward)
      (name_test
        (identifier))))
  (string_literal))

================================================================================
@id="2"
================================================================================
@id="2"
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (abbrev_foward)
      (name_test
        (identifier))))
  (string_literal))

================================================================================
@id="4"
================================================================================
@id="4"
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (abbrev_foward)
      (name_test
        (identifier))))
  (string_literal))

================================================================================
/data/item/a/number
================================================================================
/data/item/a/number
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))))

================================================================================
/data/item/a/number/@OpenClinica:this
================================================================================
/data/item/a/number/@OpenClinica:this
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (abbrev_foward)
      (name_test
        (identifier)
        (identifier)))))

================================================================================
@OpenClinica:this="three"
================================================================================
@OpenClinica:this="three"
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (abbrev_foward)
      (name_test
        (identifier)
        (identifier))))
  (string_literal))

================================================================================
../number[@OpenClinica:this="three"]
================================================================================
../number[@OpenClinica:this="three"]
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (abbrev_reverse))
    (step_expr
      (name_test
        (identifier))
      (predicate
        (path_expr
          (step_expr
            (abbrev_foward)
            (name_test
              (identifier)
              (identifier))))
        (string_literal)))))

================================================================================
@enk:that='something'
================================================================================
@enk:that='something'
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (abbrev_foward)
      (name_test
        (identifier)
        (identifier))))
  (string_literal))

================================================================================
@id='d'
================================================================================
@id='d'
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (abbrev_foward)
      (name_test
        (identifier))))
  (string_literal))

================================================================================
../number[@OpenClinica:this='three']
================================================================================
../number[@OpenClinica:this='three']
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (abbrev_reverse))
    (step_expr
      (name_test
        (identifier))
      (predicate
        (path_expr
          (step_expr
            (abbrev_foward)
            (name_test
              (identifier)
              (identifier))))
        (string_literal)))))

================================================================================
@OpenClinica:this='three'
================================================================================
@OpenClinica:this='three'
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (abbrev_foward)
      (name_test
        (identifier)
        (identifier))))
  (string_literal))

================================================================================
@enk:that="something"
================================================================================
@enk:that="something"
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (abbrev_foward)
      (name_test
        (identifier)
        (identifier))))
  (string_literal))

================================================================================
/data/item/number/@this
================================================================================
/data/item/number/@this
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (name_test
        (identifier)))
    (step_expr
      (abbrev_foward)
      (name_test
        (identifier)))))

================================================================================
@this="four"
================================================================================
@this="four"
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (abbrev_foward)
      (name_test
        (identifier))))
  (string_literal))

================================================================================
./@this="four"
================================================================================
./@this="four"
--------------------------------------------------------------------------------

(query
  (path_expr
    (step_expr
      (context_item_expr))
    (step_expr
      (abbrev_foward)
      (name_test
        (identifier))))
  (string_literal))

================================================================================
string-length(./@this) = 1
================================================================================
string-length(./@this) = 1
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (context_item_expr))
      (step_expr
        (abbrev_foward)
        (name_test
          (identifier)))))
  (integer_literal))

================================================================================
string-length(./@this) < pi()
================================================================================
string-length(./@this) < pi()
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (context_item_expr))
      (step_expr
        (abbrev_foward)
        (name_test
          (identifier)))))
  (function_call
    (identifier)))

================================================================================
string-length(./number)=1
================================================================================
string-length(./number)=1
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (context_item_expr))
      (step_expr
        (name_test
          (identifier)))))
  (integer_literal))

================================================================================
string-length(./number) = 1
================================================================================
string-length(./number) = 1
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (context_item_expr))
      (step_expr
        (name_test
          (identifier)))))
  (integer_literal))

================================================================================
(./number div 3.14) > 1.9
================================================================================
(./number div 3.14) > 1.9
--------------------------------------------------------------------------------

(query
  (parenthesized_expr
    (path_expr
      (step_expr
        (context_item_expr))
      (step_expr
        (name_test
          (identifier))))
    (decimal_literal))
  (decimal_literal))

================================================================================
tan(./number) > 1
================================================================================
tan(./number) > 1
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (context_item_expr))
      (step_expr
        (name_test
          (identifier)))))
  (integer_literal))

================================================================================
tan(./number) <= 1
================================================================================
tan(./number) <= 1
--------------------------------------------------------------------------------

(query
  (function_call
    (identifier)
    (path_expr
      (step_expr
        (context_item_expr))
      (step_expr
        (name_test
          (identifier)))))
  (integer_literal))

================================================================================
(./number div pi()) >  1.9
================================================================================
(./number div pi()) >  1.9
--------------------------------------------------------------------------------

(query
  (parenthesized_expr
    (path_expr
      (step_expr
        (context_item_expr))
      (step_expr
        (name_test
          (identifier))))
    (function_call
      (identifier)))
  (decimal_literal))

================================================================================
(./number div pi()) <= 1.9
================================================================================
(./number div pi()) <= 1.9
--------------------------------------------------------------------------------

(query
  (parenthesized_expr
    (path_expr
      (step_expr
        (context_item_expr))
      (step_expr
        (name_test
          (identifier))))
    (function_call
      (identifier)))
  (decimal_literal))
